class StringUtils < String
  def convert_unicode_to_ascii
    gsub!(/(à|á|ạ|ả|ã|â|ầ|ấ|ậ|ẩ|ẫ|ă|ằ|ắ|ặ|ẳ|ẵ)/, "a")
    gsub!(/(è|é|ẹ|ẻ|ẽ|ê|ề|ế|ệ|ể|ễ)/, "e")
    gsub!(/(ì|í|ị|ỉ|ĩ)/, "i")
    gsub!(/(ò|ó|ọ|ỏ|õ|ô|ồ|ố|ộ|ổ|ỗ|ơ|ờ|ớ|ợ|ở|ỡ)/, "o")
    gsub!(/(ù|ú|ụ|ủ|ũ|ư|ừ|ứ|ự|ử|ữ)/, "u")
    gsub!(/(ỳ|ý|ỵ|ỷ|ỹ)/, "y")
    gsub!(/(đ)/, "d")
    gsub!(/(À|Á|Ạ|Ả|Ã|Â|Ầ|Ấ|Ậ|Ẩ|Ẫ|Ă|Ằ|Ắ|Ặ|Ẳ|Ẵ)/, "A")
    gsub!(/(È|É|Ẹ|Ẻ|Ẽ|Ê|Ề|Ế|Ệ|Ể|Ễ)/, "E")
    gsub!(/(Ì|Í|Ị|Ỉ|Ĩ)/, "I")
    gsub!(/(Ò|Ó|Ọ|Ỏ|Õ|Ô|Ồ|Ố|Ộ|Ổ|Ỗ|Ơ|Ờ|Ớ|Ợ|Ở|Ỡ)/, "O")
    gsub!(/(Ù|Ú|Ụ|Ủ|Ũ|Ư|Ừ|Ứ|Ự|Ử|Ữ)/, "U")
    gsub!(/(Ỳ|Ý|Ỵ|Ỷ|Ỹ)/, "Y")
    gsub!(/(Đ)/, "D")
  end
end
